@echo on
::
:: https://www.youtube.com/watch?v=wrSSFiD4hGk

::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
:: SysMain
:: 止めてみる

:: 不要なスタートアップを止める
::

::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
::  ハードディスク関連
::::::::::::::::::::::::::::::::::::::::::::::::::::::::::

:: Cドライブを開ける
:: ディスクのクリーンアップ
::  システムファイルのクリーンアップ

:: Windows の一時フォルダの中身を削除
start temp

:: ユーザ の一時フォルダの中身を削除
del %temp%\* /S /Q


:: 検索
:: >1GB

pause

::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
:: 『- 　システムの健康診断 方法　--』
:: ※　DISM【展開イメージのサービスと管理】※
:: ↓これをコピーしてください↓
DISM.exe /Online /Cleanup-image /Restorehealth

:: ※　SFC(システムファイル・チェッカー・ツール）※
:: ↓これをコピーしてください↓
sfc /scannow

:: ※ ディスクのエラーチェック
:: ↓これをコピーしてください↓
chkdsk C: /rsfc /scannow
:: イベントログ： Win init で確認できる

::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
::  ハードディスク関連
::::::::::::::::::::::::::::::::::::::::::::::::::::::::::
:: Windowsメモリー診断
:: イベントログ： MemoryDiagnostice-Resu で確認できる
::   エラーがあれば部品交換が必要

:: もしくは
:: MemTest86 free edition


pause

